# Project Title & Description

Retail Sales Analysis - This project analyzes retail sales data to generate insights on product performance, customer spending patterns, and revenue trends. The dataset is cleaned, processed, and analyzed using pandas, enabling business-ready insights
Uses Python + Pandas

Analyses retail sales data

-Load data

In [2]:
import pandas as pd
df = pd.read_csv('business_sales_jan2025.csv')
df.head(5)

   order_id        date   product  qty   price customer_id
0      1001  2025-01-01     Cream  3.0  1200.0        C016
1      1002  2025-01-01     Shirt  3.0   800.0        C002
2      1003  2025-01-01     Shoes  4.0  1500.0        C009
3      1004  2025-01-01     Watch  3.0  1200.0        C012
4      1005  2025-01-01  Facewash  3.0   200.0        C014

-Data viewing

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     70 non-null     int64
 1   date         70 non-null     object
 2   product      69 non-null     object
 3   qty          68 non-null     float64
 4   price        68 non-null     float64
 5   customer_id  70 non-null     object
dtypes: float64(2), int64(1), object(3)
memory usage: 3.4+ KB

In [4]:
df.describe()

          order_id        qty        price
count    70.000000  68.000000    68.000000
mean   1035.500000   2.750000   710.294118
std      20.351085   1.084146   488.949439
min    1001.000000   1.000000   150.000000
25%    1018.250000   2.000000   200.000000
50%    1035.500000   3.000000   800.000000
75%    1052.750000   4.000000  1200.000000
max    1070.000000   4.000000  1500.000000

In [5]:
df.columns

Index(['order_id', 'date', 'product', 'qty', 'price', 'customer_id'], dtype='object')

In [6]:
df.shape

(70, 6)

In [7]:
df.dtypes

order_id         int64
date            object
product         object
qty            float64
price          float64
customer_id     object
dtype: object

-Data before cleaning

In [8]:
print("Before Cleaning:")
print("Shape:", df.shape)
print("Missing values:\n", df.isnull().sum())

Before Cleaning:
Shape: (70, 6)
Missing values:
 order_id       0
date           0
product        1
qty            2
price          2
customer_id    0
dtype: int64

-Data cleaning

In [9]:
#Converts every product name to lowercase and remove all extra spaces
df['product'] = df['product'].str.strip().str.lower()
df = df.drop_duplicates()
df

    order_id        date   product  qty   price customer_id
0       1001  2025-01-01     cream  3.0  1200.0        C016
1       1002  2025-01-01     shirt  3.0   800.0        C002
2       1003  2025-01-01     shoes  4.0  1500.0        C009
3       1004  2025-01-01     watch  3.0  1200.0        C012
4       1005  2025-01-01  facewash  3.0   200.0        C014
..       ...         ...       ...  ...     ...         ...
65      1066  2025-01-11     shoes  2.0   150.0        C001
66      1067  2025-01-11     shoes  3.0  1500.0        C003
67      1068  2025-01-11   perfume  3.0   500.0        C016
68      1069  2025-01-11       cap  4.0   800.0        C013
69      1070  2025-01-12  facewash  2.0  1200.0        C007

[70 rows x 6 columns]

-fixing nulls

In [10]:
#droping duplicates
df = df.drop_duplicates()
df

    order_id        date   product  qty   price customer_id
0       1001  2025-01-01     cream  3.0  1200.0        C016
1       1002  2025-01-01     shirt  3.0   800.0        C002
2       1003  2025-01-01     shoes  4.0  1500.0        C009
3       1004  2025-01-01     watch  3.0  1200.0        C012
4       1005  2025-01-01  facewash  3.0   200.0        C014
..       ...         ...       ...  ...     ...         ...
65      1066  2025-01-11     shoes  2.0   150.0        C001
66      1067  2025-01-11     shoes  3.0  1500.0        C003
67      1068  2025-01-11   perfume  3.0   500.0        C016
68      1069  2025-01-11       cap  4.0   800.0        C013
69      1070  2025-01-12  facewash  2.0  1200.0        C007

[70 rows x 6 columns]

In [11]:
#fixing duplicates
df = df.fillna(0)

In [12]:
#-converting the date column from text
df['date'] = pd.to_datetime(df['date'], format='%Y-%m-%d')
df['month'] = df['date'].dt.to_period('M')
df['date'].dtype

dtype('<M8[ns]')

-Data after cleaning

In [13]:
print("After Cleaning:")
print("Shape:", df.shape)
print("Missing values:\n", df.isnull().sum())

After Cleaning:
Shape: (70, 7)
Missing values:
 order_id       0
date           0
product        0
qty            0
price          0
customer_id    0
month          0
dtype: int64

-creating new useful columns:

amount = qty × price

In [14]:
df['amount'] = df['qty']*df['price']
df

    order_id       date   product  qty   price customer_id    month  amount
0       1001 2025-01-01     cream  3.0  1200.0        C016  2025-01  3600.0
1       1002 2025-01-01     shirt  3.0   800.0        C002  2025-01  2400.0
2       1003 2025-01-01     shoes  4.0  1500.0        C009  2025-01  6000.0
3       1004 2025-01-01     watch  3.0  1200.0        C012  2025-01  3600.0
4       1005 2025-01-01  facewash  3.0   200.0        C014  2025-01   600.0
..       ...        ...       ...  ...     ...         ...      ...     ...
65      1066 2025-01-11     shoes  2.0   150.0        C001  2025-01   300.0
66      1067 2025-01-11     shoes  3.0  1500.0        C003  2025-01  4500.0
67      1068 2025-01-11   perfume  3.0   500.0        C016  2025-01  1500.0
68      1069 2025-01-11       cap  4.0   800.0        C013  2025-01  3200.0
69      1070 2025-01-12  facewash  2.0  1200.0        C007  2025-01  2400.0

[70 rows x 8 columns]

Product Analysis

In [15]:
#. Total quantity sold per product
df.groupby('product')['qty'].sum()

product
0            3.0
cap         17.0
cream       31.0
facewash    36.0
jeans       13.0
perfume     13.0
shirt       24.0
shoes       27.0
watch       23.0
Name: qty, dtype: float64

In [16]:
#Total amount per product
df.groupby('product')['amount'].sum()

product
0            1500.0
cap         10800.0
cream       19000.0
facewash    13300.0
jeans        9600.0
perfume     13100.0
shirt       14350.0
shoes       27450.0
watch       18900.0
Name: amount, dtype: float64

In [17]:
#Number of orders per product
df.groupby('product').size()

product
0            1
cap          5
cream       11
facewash    16
jeans        4
perfume      5
shirt        9
shoes        9
watch       10
dtype: int64

In [18]:
#4. Average order value per product
df.groupby('product')['amount'].mean()

product
0           1500.000000
cap         2160.000000
cream       1727.272727
facewash     831.250000
jeans       2400.000000
perfume     2620.000000
shirt       1594.444444
shoes       3050.000000
watch       1890.000000
Name: amount, dtype: float64

customer analysing

In [19]:
#Which customers spend the most?
df.groupby('customer_id')['amount'].sum().sort_values(ascending=False)

customer_id
C003    21300.0
C009    16600.0
C020    12000.0
C002    11000.0
C006    10400.0
C013     8200.0
C018     6800.0
C016     5300.0
C004     5250.0
C019     5200.0
C001     4500.0
C014     4050.0
C012     3900.0
C010     3500.0
C015     3200.0
C007     2400.0
C017     2100.0
C005     1300.0
C011     1000.0
Name: amount, dtype: float64

In [20]:
#Who are repeat customers?
df.groupby('customer_id').size().sort_values(ascending=False)

customer_id
C003    7
C019    6
C002    5
C020    5
C006    5
C009    5
C001    4
C014    4
C013    4
C004    4
C005    3
C016    3
C015    3
C018    3
C017    3
C010    2
C012    2
C011    1
C007    1
dtype: int64

In [21]:
#How much each customer has spent in total (customer lifetime value)?
df.groupby('customer_id')['amount'].sum().sort_values(ascending=False)

customer_id
C003    21300.0
C009    16600.0
C020    12000.0
C002    11000.0
C006    10400.0
C013     8200.0
C018     6800.0
C016     5300.0
C004     5250.0
C019     5200.0
C001     4500.0
C014     4050.0
C012     3900.0
C010     3500.0
C015     3200.0
C007     2400.0
C017     2100.0
C005     1300.0
C011     1000.0
Name: amount, dtype: float64

-Final Summary

In [22]:
#Total Revenue
df['amount'].sum()

np.float64(128000.0)

In [23]:
#Total Orders
df['order_id'].count()

np.int64(70)

In [24]:
#Average Order Value
df['amount'].mean()

np.float64(1828.5714285714287)

In [25]:
#Highest Selling Product (by qty)
df.groupby('product')['qty'].sum().sort_values(ascending=False)

product
facewash    36.0
cream       31.0
shoes       27.0
shirt       24.0
watch       23.0
cap         17.0
jeans       13.0
perfume     13.0
0            3.0
Name: qty, dtype: float64

In [26]:
#Top Revenue Product (by amount)
df.groupby('product')['amount'].sum().sort_values(ascending=False).head(1)

product
shoes    27450.0
Name: amount, dtype: float64

In [27]:
#Top Customer (lifetime value)
df.groupby('customer_id')['amount'].sum().sort_values(ascending=False).head(1)

customer_id
C003    21300.0
Name: amount, dtype: float64

In [28]:
#Number of Repeat Customers
(df.groupby('customer_id').size() > 1).sum()

np.int64(17)

In [29]:
#Monthly Revenue
df.groupby('month')['amount'].sum()

month
2025-01    128000.0
Freq: M, Name: amount, dtype: float64

In [30]:
#Monthly Orders
df.groupby('month').size()

month
2025-01    70
Freq: M, dtype: int64

In [32]:
import pandas as pd

summary = {
    "Metric": [
        "Total Revenue",
        "Total Orders",
        "Average Order Value",
        "Best-Selling Product",
        "Highest Revenue Product",
        "Top Customer",
        "Repeat Customers",
        "January Revenue",
        "January Orders",
        "January Average Order Value",
        "Best Product in January"
    ],
    "Value": [
        df['amount'].sum(),
        df['order_id'].count(),
        df['amount'].mean(),
        df.groupby('product')['qty'].sum().sort_values(ascending=False).idxmax(),
        df.groupby('product')['amount'].sum().sort_values(ascending=False).idxmax(),
        df.groupby('customer_id')['amount'].sum().sort_values(ascending=False).idxmax(),
        (df.groupby('customer_id').size() > 1).sum(),
        df[df['month'] == '2025-01']['amount'].sum(),
        df[df['month'] == '2025-01']['order_id'].count(),
        df[df['month'] == '2025-01']['amount'].mean(),
        df[df['month'] == '2025-01'].groupby('product')['amount'].sum().sort_values(ascending=False).idxmax()
    ]
}

summary_df = pd.DataFrame(summary)
summary_df

                         Metric        Value
0                 Total Revenue     128000.0
1                  Total Orders           70
2           Average Order Value  1828.571429
3          Best-Selling Product     facewash
4       Highest Revenue Product        shoes
5                  Top Customer         C003
6              Repeat Customers           17
7               January Revenue     128000.0
8                January Orders           70
9   January Average Order Value  1828.571429
10      Best Product in January        shoes

# Project Conclusion - 
This project helped me practice data cleaning, feature engineering, grouping, and generating business insights using Pandas.I learned to handle missing data, create new features, analyze customers/products, and present business-ready insights